# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingTypeSet..::..Erase Method
TemperatureRatingTypeSet Class See Also
---
Removes a specified TemperatureRating type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	TemperatureRatingType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As TemperatureRatingType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	TemperatureRatingType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeThe TemperatureRating type to be erased.
# ### Return Value
The number of TemperatureRating types that were erased from the set.
# See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace